#+TITLE: Python Basics
#+DATE: 2023-07-07T20:47:51+09:00
#+PUBLISHDATE: 2023-07-07T20:47:51+09:00
#+CATEGORIES[]: python
#+DESCRIPTION: Short description

* Dictionary

** initialization
#+begin_src python :results output
d = dict(([1,2], [3,4], [5,6]))
print(d)
d = dict(('12', '34', '56')) # length of sequence elements must be 2
print(d)
d = {"1": "2", "3": "4", "5": "6"}
print(d)
d = {a:b for a,b in zip([1,3,5], [2,4,6])}
print(d)
#+end_src

#+RESULTS:
: {1: 2, 3: 4, 5: 6}
: {'1': '2', '3': '4', '5': '6'}
: {'1': '2', '3': '4', '5': '6'}
: {1: 2, 3: 4, 5: 6}
